{
  "char2idx": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    " ": 4,
    "e": 5,
    "s": 6,
    "1": 7,
    "a": 8,
    "r": 9,
    "l": 10,
    "t": 11,
    "n": 12,
    "0": 13,
    "c": 14,
    "o": 15,
    "h": 16,
    "i": 17,
    "7": 18,
    "d": 19,
    "2": 20,
    "3": 21,
    "u": 22,
    "5": 23,
    "6": 24,
    "4": 25,
    "8": 26,
    ")": 27,
    "m": 28,
    "9": 29,
    "b": 30,
    "f": 31,
    "y": 32,
    "w": 33,
    "(": 34,
    "x": 35,
    "p": 36,
    "g": 37,
    "v": 38,
    "k": 39,
    "q": 40,
    "j": 41,
    "z": 42,
    ",": 43,
    "-": 44,
    "|": 45,
    "=": 46,
    "\\": 47,
    "*": 48,
    "'": 49,
    "_": 50,
    ".": 51,
    "+": 52,
    "/": 53,
    "%": 54,
    "#": 55,
    "$": 56,
    "<": 57,
    ">": 58,
    ":": 59,
    ";": 60,
    "&": 61,
    "@": 62,
    "?": 63,
    "!": 64,
    "~": 65,
    "`": 66,
    "]": 67,
    "{": 68,
    "^": 69,
    "[": 70,
    "}": 71,
    "\"": 72,
    "E": 73,
    "L": 74,
    "S": 75,
    "T": 76,
    "C": 77,
    "O": 78,
    "R": 79,
    "A": 80,
    "I": 81,
    "N": 82,
    "X": 83,
    "B": 84,
    "D": 85,
    "U": 86,
    "M": 87,
    "F": 88,
    "H": 89,
    "K": 90,
    "W": 91,
    "\t": 92,
    "\n": 93,
    "\u000b": 94,
    "P": 95,
    "\f": 96,
    "Y": 97,
    "G": 98,
    "В ": 99,
    "V": 100,
    "J": 101,
    "Z": 102,
    "Q": 103,
    "\r": 104,
    "Г©": 105,
    "В–": 106,
    "вҖҷ": 107,
    "вҖҳ": 108,
    "В…": 109,
    "\u0018": 110,
    "ВҖ": 111,
    "Вҳ": 112,
    "Гў": 113,
    "В—": 114,
    "Вҙ": 115,
    "вҖ“": 116,
    "ГЎ": 117,
    "Гғ": 118,
    "ВҪ": 119,
    "ГӨ": 120,
    "Г¶": 121,
    "Гӯ": 122,
    "В‘": 123,
    "Г§": 124,
    "ВЁ": 125,
    "ГҪ": 126,
    "ГӘ": 127,
    "вҖІ": 128,
    "ВЈ": 129,
    "вҖҰ": 130,
    "ГӮ": 131,
    "Г„": 132,
    "ВЎ": 133,
    "Г ": 134,
    "Гі": 135,
    "ГЈ": 136,
    "Гң": 137,
    "Гј": 138,
    "Г–": 139,
    "вҖң": 140,
    "вҖӢ": 141
  },
  "idx2char": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": " ",
    "5": "e",
    "6": "s",
    "7": "1",
    "8": "a",
    "9": "r",
    "10": "l",
    "11": "t",
    "12": "n",
    "13": "0",
    "14": "c",
    "15": "o",
    "16": "h",
    "17": "i",
    "18": "7",
    "19": "d",
    "20": "2",
    "21": "3",
    "22": "u",
    "23": "5",
    "24": "6",
    "25": "4",
    "26": "8",
    "27": ")",
    "28": "m",
    "29": "9",
    "30": "b",
    "31": "f",
    "32": "y",
    "33": "w",
    "34": "(",
    "35": "x",
    "36": "p",
    "37": "g",
    "38": "v",
    "39": "k",
    "40": "q",
    "41": "j",
    "42": "z",
    "43": ",",
    "44": "-",
    "45": "|",
    "46": "=",
    "47": "\\",
    "48": "*",
    "49": "'",
    "50": "_",
    "51": ".",
    "52": "+",
    "53": "/",
    "54": "%",
    "55": "#",
    "56": "$",
    "57": "<",
    "58": ">",
    "59": ":",
    "60": ";",
    "61": "&",
    "62": "@",
    "63": "?",
    "64": "!",
    "65": "~",
    "66": "`",
    "67": "]",
    "68": "{",
    "69": "^",
    "70": "[",
    "71": "}",
    "72": "\"",
    "73": "E",
    "74": "L",
    "75": "S",
    "76": "T",
    "77": "C",
    "78": "O",
    "79": "R",
    "80": "A",
    "81": "I",
    "82": "N",
    "83": "X",
    "84": "B",
    "85": "D",
    "86": "U",
    "87": "M",
    "88": "F",
    "89": "H",
    "90": "K",
    "91": "W",
    "92": "\t",
    "93": "\n",
    "94": "\u000b",
    "95": "P",
    "96": "\f",
    "97": "Y",
    "98": "G",
    "99": "В ",
    "100": "V",
    "101": "J",
    "102": "Z",
    "103": "Q",
    "104": "\r",
    "105": "Г©",
    "106": "В–",
    "107": "вҖҷ",
    "108": "вҖҳ",
    "109": "В…",
    "110": "\u0018",
    "111": "ВҖ",
    "112": "Вҳ",
    "113": "Гў",
    "114": "В—",
    "115": "Вҙ",
    "116": "вҖ“",
    "117": "ГЎ",
    "118": "Гғ",
    "119": "ВҪ",
    "120": "ГӨ",
    "121": "Г¶",
    "122": "Гӯ",
    "123": "В‘",
    "124": "Г§",
    "125": "ВЁ",
    "126": "ГҪ",
    "127": "ГӘ",
    "128": "вҖІ",
    "129": "ВЈ",
    "130": "вҖҰ",
    "131": "ГӮ",
    "132": "Г„",
    "133": "ВЎ",
    "134": "Г ",
    "135": "Гі",
    "136": "ГЈ",
    "137": "Гң",
    "138": "Гј",
    "139": "Г–",
    "140": "вҖң",
    "141": "вҖӢ"
  },
  "vocab_size": 142,
  "max_len": 256
}